Revit 2027 API
UV.Normalize Method
Returns a new UV whose coordinates are the normalized values from this vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV Normalize()
Public Function Normalize As UV
public:
UV^ Normalize()
member Normalize : unit -> UV
Return Value
UV
The normalized UV or zero if the vector is almost Zero.
Remarks
 Normalized indicates that the length of this vector equals one (a unit vector).
See Also
Reference
UV Class
Autodesk.Revit.DB Namespace